IDEA Open Model
ConcreteBlock Class
Compatible with IDEA StatiCa Beta 20.0
 Data of concrete block
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.ConcreteBlock
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ConcreteBlock
Public Class ConcreteBlock
The ConcreteBlock type exposes the following members.
Constructors
Name | Description
ConcreteBlock
Initializes a new instance of the ConcreteBlock class
Top
Properties
Name | Description
Height
 Height of ConcreteBlock
Lenght
 Lenght of ConcreteBlock
Material
 Material of ConcreteBlock
Width
 Width of ConcreteBlock
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace